app/controllers/boards_controller.rb

  def index
    @recent_boards = Board.last_ten_records
    @boards = Board.all
---
SELECT "boards".* FROM "boards"

  def create
    if @board.save!
---
INSERT INTO "boards" ("email", "mines", "rows", "cols", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "test@gmail.com"], ["mines", "{4,2,3,17,18}"], ["rows", 5], ["cols", 5], ["created_at", "2024-01-05 16:14:37.170012"], ["updated_at", "2024-01-05 16:14:37.170012"]]

  def find_board
    @board = Board.find_by(id: params[:id])
---
SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]